In [1]:
from random import sample
from datetime import date, datetime
from pydbgen import pydbgen
import pandas as pd
import numpy as np 
import random

# Age variable

In [2]:
# def calculate_age(born):
#     born = datetime.strptime(born, '%Y-%m-%d').date()
#     today = date.today()
#     return today.year - born.year - ((today.month,
#                                       today.day) < (born.month,
#                                                     born.day))

In [16]:
# DB = pydbgen.pydb()
# Age = DB.gen_dataframe(250, fields=['date'])
# Age['age'] = Age['date'].apply(calculate_age)
# Age

           date  age
0    2017-10-24    4
1    2016-01-12    5
2    1996-11-10   25
3    1984-11-13   37
4    2001-10-05   20
..          ...  ...
245  1979-09-18   42
246  2010-05-31   11
247  1973-03-17   48
248  2014-12-22    6
249  1980-02-18   41

[250 rows x 2 columns]

In [21]:
np.random.seed(1)
age = np.round(np.random.normal(40, 10, 250))
age = pd.DataFrame(age, columns = ['Age'])
age

      Age
0    56.0
1    34.0
2    35.0
3    29.0
4    49.0
..    ...
245  47.0
246  46.0
247  36.0
248  58.0
249  27.0

[250 rows x 1 columns]

# Name and Gender variable

In [53]:
first_names_gender = (pd.read_csv('data/name_gender_dataset.csv'))[['Name', 'Gender']]
first_names_gender = first_names_gender.sample(n = 250, random_state=1)
first_names_gender = first_names_gender.rename(columns = {'Name' : 'First_Name'})
first_names_gender

            First_Name Gender
144506         Semideo      M
893              Sheri      F
142324          Necati      M
101964          Monyka      F
143433  Rainer-Francis      M
...                ...    ...
29806         Sabrinia      F
56481            Zolah      F
29099            Falen      F
56537          Harroll      M
114827           Khobi      M

[250 rows x 2 columns]

In [59]:
last_names = (pd.read_csv('data/most-common-name_surnames.csv'))['name']
last_names = pd.DataFrame(last_names)
last_names = last_names.sample(250, random_state=1)
last_names.columns = ['Last_Name']
last_names

    Last_Name
507   AGUIRRE
818   MCMAHON
452   PARSONS
368  GRIFFITH
242   GILBERT
..        ...
385     QUINN
890     BURCH
439      TATE
135     OLSON
567    MASSEY

[250 rows x 1 columns]

# BMI and Height

In [49]:
weight_height = pd.read_csv('data/weight-height.csv')
weight_height['Height'] = weight_height['Height']/100
weight_height['bmi'] = (weight_height['Weight']/(weight_height['Height'])**2)
weight_height = weight_height.drop('Gender', 1)
weight_height = weight_height.sample(250, random_state = 1)
weight_height

         Weight    Height        bmi
9953  61.278349  1.325342  34.885982
3850  70.454991  1.908249  19.348242
4962  70.144763  1.948314  18.478953
3886  69.231469  1.738296  22.911633
5437  68.759636  1.536897  29.110109
...         ...       ...        ...
7012  61.844966  1.109816  50.211384
9052  63.741101  1.316880  36.755908
1893  73.058463  1.955929  19.096968
5847  58.470984  1.030460  55.065365
5635  67.555899  1.544370  28.324398

[250 rows x 3 columns]

In [ ]:
# height = np.round(np.random.normal(170,10,250),1)
# height = pd.DataFrame(height, columns = ['Height'])
# height

# Country and City

# Case-Control Status

In [83]:
random.seed(1)
case_control = ['case', 'control']
case_control_df = random.choices(case_control, k = 250)
case_control_df = pd.DataFrame(case_control_df, columns = ['case_control status'])
case_control_df

    case_control status
0                  case
1               control
2               control
3                  case
4                  case
..                  ...
245                case
246             control
247                case
248                case
249                case

[250 rows x 1 columns]

# Education Level

In [80]:
random.seed(1)
education_level = ['primary', 'high school', 'bachelor', 'master', 'phD']
education_df = random.choices(education_level, k = 250)
education_df = pd.DataFrame(education_df, columns = ['education level'])
education_df

    education level
0           primary
1               phD
2            master
3       high school
4          bachelor
..              ...
245     high school
246        bachelor
247     high school
248         primary
249     high school

[250 rows x 1 columns]

# Gene Expression Values

# SNP Values

In [ ]:
# random.seed(1)
# snp = [0, 1, 2]
# snp_df = random.choices(snp, k = 5)

# Combining all data into one dataframe

In [23]:
# simulation['First_Name'] = first_names_gender['Name']
# simulation['Gender'] = first_names_gender['Gender']
# simulation['Last_Name'] = last_names
simulation = pd.concat([first_names_gender, last_names, age], axis = 1)
simulation

             Name Gender      name   Age
0             NaN    NaN       NaN  56.0
1             NaN    NaN       NaN  34.0
2             NaN    NaN  WILLIAMS  35.0
3             NaN    NaN     BROWN  29.0
4             NaN    NaN       NaN  49.0
...           ...    ...       ...   ...
144373    Sateesh      M       NaN   NaN
144506    Semideo      M       NaN   NaN
145021     Sooraj      M       NaN   NaN
145117  Stavrakis      M       NaN   NaN
146853     Yeshas      M       NaN   NaN

[683 rows x 4 columns]